Repository: GarlandQian/mica-mac
Catalog: Sources/Mica/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# diagnostics.controller
source: Controller: %@
zh_hans: 控制器：%@

# diagnostics.controller_adapter
source: Controller Adapter: %@
zh_hans: 控制器适配器：%@

# diagnostics.controller_health
source: Controller Health: %@
zh_hans: 控制器健康：%@

# diagnostics.copy_report
source: Copy Report
zh_hans: 复制报告

# diagnostics.copy_targets
source: Export reports
zh_hans: 导出报告

# diagnostics.core_compatibility
source: Core Compatibility: %@
zh_hans: 核心兼容性：%@

# diagnostics.coverage_count %lld
source: %lld data areas
zh_hans: %lld 个数据区域

# diagnostics.coverage_summary
source: Data availability
zh_hans: 数据可用性

# diagnostics.coverage_surface
source: Data
zh_hans: 数据

# diagnostics.coverage_title
source: Data availability
zh_hans: 数据可用性

# diagnostics.display_endpoint_summary %lld %lld %lld %lld
source: Readiness: %lld of %lld base checks ready; %lld of %lld enhanced checks ready
zh_hans: 就绪度：基础检查 %lld/%lld 就绪；增强检查 %lld/%lld 就绪

# diagnostics.endpoint_checks
source: Endpoint checks
zh_hans: 端点检测

# diagnostics.endpoint_results_title
source: Mica Endpoint Test Results
zh_hans: Mica 端点测试结果

# diagnostics.enhanced_endpoints
source: Enhanced Data: %@
zh_hans: 增强数据：%@

# diagnostics.export_reports
source: Export reports
zh_hans: 导出报告

# diagnostics.field_trial_evidence
source: Next Steps and Exports
zh_hans: 下一步和导出

# diagnostics.full_report_title
source: Mica Diagnostics Report
zh_hans: Mica 诊断报告

# diagnostics.insight
source: Data Summary: %@
zh_hans: 数据摘要：%@

# diagnostics.insight_summary_counts %lld %lld %lld %lld
source: %lld connections, %lld rules, %lld sources, %lld latency samples
zh_hans: %lld 个连接，%lld 条规则，%lld 个来源，%lld 个延迟样本

# diagnostics.last_connected
source: Last Connected: %@
zh_hans: 上次连接：%@

# diagnostics.mode
source: Mode: %@
zh_hans: 模式：%@

# diagnostics.never
source: never
zh_hans: 从未

# diagnostics.next_actions_exports
source: Next actions and exports
zh_hans: 下一步和导出

# diagnostics.none
source: None
zh_hans: 无

# diagnostics.observability
source: Monitoring Status: %@
zh_hans: 监控状态：%@

# diagnostics.operation_cache_flush
source: Cache Flush
zh_hans: 缓存刷新

# diagnostics.operation_cache_flush_detail
source: Flush the selected mihomo-compatible controller's FakeIP cache through the external-controller API.
zh_hans: 通过 external-controller API 刷新当前 mihomo-compatible 控制器的 FakeIP 缓存。

# diagnostics.operation_connections
source: Connection Management
zh_hans: 连接管理

# diagnostics.operation_connections_detail
source: Active and closed connection controls depend on the selected backend's connection and kill capability.
zh_hans: 活跃/已关闭连接控制取决于当前后端的连接列表和关闭能力。

# diagnostics.operation_core_config_detail
source: Mode display and mode changes are enabled only when the remote controller reports config support.
zh_hans: 只有远程控制器报告配置支持时，才启用模式显示和模式切换。

# diagnostics.operation_core_lifecycle
source: Core Lifecycle
zh_hans: 核心生命周期

# diagnostics.operation_core_lifecycle_detail
source: Remote restart and upgrade are exposed only through the selected mihomo-compatible external-controller. Mica still does not download, bundle, or run a local core.
zh_hans: 远程重启和升级只通过当前 mihomo-compatible external-controller 暴露。Mica 仍然不会下载、内置或运行本地核心。

# diagnostics.operation_core_lifecycle_evidence %lld %lld
source: %lld restarts / %lld upgrades
zh_hans: %lld 次重启 / %lld 次升级

# diagnostics.operation_core_restart
source: Remote Core Restart
zh_hans: 远程核心重启

# diagnostics.operation_core_restart_detail
source: Send POST /restart to the selected mihomo-compatible controller after confirmation.
zh_hans: 确认后向当前 mihomo-compatible 控制器发送 POST /restart。

# diagnostics.operation_core_restart_evidence %lld
source: %lld remote restarts
zh_hans: %lld 次远程重启

# diagnostics.operation_core_upgrade
source: Remote Core Upgrade
zh_hans: 远程核心升级

# diagnostics.operation_core_upgrade_detail
source: Send POST /upgrade to the selected mihomo-compatible controller after confirmation.
zh_hans: 确认后向当前 mihomo-compatible 控制器发送 POST /upgrade。

# diagnostics.operation_core_upgrade_evidence %lld
source: %lld remote upgrades
zh_hans: %lld 次远程升级

# diagnostics.operation_dns_flush
source: DNS Flush
zh_hans: DNS 刷新

# diagnostics.operation_dns_flush_detail
source: Flush the selected controller's DNS cache through a supported remote controller API.
zh_hans: 通过受支持的远程控制器 API 刷新当前控制器的 DNS 缓存。

# diagnostics.operation_dns_flush_evidence %lld
source: %lld DNS cache flushes
zh_hans: %lld 次 DNS 缓存刷新

# diagnostics.operation_evidence_summary %@ %@
source: Source %@ is %@
zh_hans: 来源 %@ 当前为 %@

# diagnostics.operation_external_resources
source: External Resources
zh_hans: 外部资源

# diagnostics.operation_external_resources_detail
source: Sources and resource data are shown only when the selected backend can report them.
zh_hans: 只有当前后端能报告来源和资源数据时，才显示相关数据。

# diagnostics.operation_configuration_reload_evidence %lld
source: %lld configuration reloads
zh_hans: %lld 次配置重新加载

# diagnostics.operation_fakeip_flush_evidence %lld
source: %lld FakeIP cache flushes
zh_hans: %lld 次 FakeIP 缓存刷新

# diagnostics.operation_geo_update_evidence %lld
source: %lld GeoData updates
zh_hans: %lld 次 GeoData 更新

# diagnostics.operation_geo_resources
source: Geo Resources
zh_hans: Geo 资源

# diagnostics.operation_geo_resources_detail
source: Refresh GeoIP and geosite databases when the selected remote controller supports this operation.
zh_hans: 当前远程控制器支持时，可刷新 GeoIP 和 geosite 数据库。

# diagnostics.operation_logs
source: Logs / Live Observation
zh_hans: 日志 / 实时观测

# diagnostics.operation_logs_detail
source: Live observation shows controller log messages in the workspace; copied reports exclude credentials and raw stream bodies.
zh_hans: 实时观测会在工作区显示控制器日志消息；复制报告排除凭据和原始流正文。

# diagnostics.operation_memory
source: Memory
zh_hans: 内存

# diagnostics.operation_memory_detail
source: Read aggregate memory usage from the selected mihomo-compatible controller without storing debug data.
zh_hans: 读取当前 mihomo-compatible 控制器的聚合内存用量，不保存调试数据。

# diagnostics.operation_memory_evidence %@ %@
source: Memory %@ / limit %@
zh_hans: 内存 %@ / 上限 %@

# diagnostics.operation_next_failed
source: Fix controller health, then run Test or Refresh again.
zh_hans: 先修复控制器健康状态，然后再次测试或刷新。

# diagnostics.operation_next_partial
source: Partially available; use the matching workspace only after target confirmation.
zh_hans: 部分可用；确认目标后再在对应工作区使用。

# diagnostics.operation_next_supported
source: Available through the matching workspace with existing confirmations.
zh_hans: 可在对应工作区使用，并保留现有确认流程。

# diagnostics.operation_next_test_refresh
source: Run Test Connection or Refresh before relying on this operation.
zh_hans: 先运行连接测试或刷新，再依赖此操作。

# diagnostics.operation_next_unavailable
source: Unavailable for this backend; Mica will not send a request.
zh_hans: 当前后端不可用；Mica 不会发送请求。

# diagnostics.operation_provider_update
source: Provider Update
zh_hans: 来源更新

# diagnostics.operation_provider_update_detail
source: Provider updates stay row-confirmed and are enabled only when the backend supports provider update.
zh_hans: 来源更新保持逐行确认，且仅在后端支持时启用。

# diagnostics.operation_rules
source: Rules
zh_hans: 规则

# diagnostics.operation_rules_detail
source: Rules data and reloads depend on the selected backend's rule capability.
zh_hans: 规则数据和重载取决于当前后端的规则能力。

# diagnostics.operation_running
source: Running
zh_hans: 执行中

# diagnostics.operation_runtime_status
source: Runtime Status
zh_hans: 运行状态

# diagnostics.operation_runtime_status_detail
source: Shows runtime status such as goroutine or backend state only when a real remote API adapter supports it.
zh_hans: 仅在真实远程 API 适配器支持时显示 goroutine 或后端状态等运行状态。

# diagnostics.operation_source_backend_boundary
source: Backend boundary
zh_hans: 后端边界

# diagnostics.operation_source_configs
source: Configs
zh_hans: 配置

# diagnostics.operation_source_connections
source: Connections
zh_hans: 连接

# diagnostics.operation_source_live_logs
source: Live / Logs
zh_hans: 实时 / 日志

# diagnostics.operation_source_provider_update
source: Provider update
zh_hans: 来源更新

# diagnostics.operation_source_providers
source: Sources
zh_hans: 来源

# diagnostics.operation_source_rules
source: Rules
zh_hans: 规则

# diagnostics.operation_tailscale_detail
source: Tailscale state remains unavailable until a dedicated backend adapter exists.
zh_hans: 只有存在专用后端适配器后，才会显示 Tailscale 状态。

# diagnostics.policy_groups
source: Policy Groups: %lld
zh_hans: 策略组：%lld

# diagnostics.provider_snapshot
source: Sources Data: %@
zh_hans: 来源数据：%@

# diagnostics.proxy_providers
source: Sources: %lld
zh_hans: 来源：%lld

# diagnostics.qa_sections
source: Report Sections:
zh_hans: 报告区段：

# diagnostics.qa_summary
source: Check Summary: %@
zh_hans: 检查摘要：%@

# diagnostics.report_excludes_credentials
source: Reports omit credentials
zh_hans: 报告不含凭据

# diagnostics.report_export
source: Export
zh_hans: 导出

# diagnostics.report_policy
source: Report policy: copied reports exclude credentials and raw response bodies
zh_hans: 报告策略：复制报告排除凭据和原始响应正文

# diagnostics.report_policy_value
source: active-ui=full-controller-data; copied-report=credentials-and-raw-response-bodies-excluded
zh_hans: 活跃界面=完整控制器数据；复制报告=排除凭据和原始响应正文

# diagnostics.report_preview_title
source: Diagnostics Report
zh_hans: 诊断报告

# diagnostics.report_scope
source: Data visibility
zh_hans: 数据可见性

# diagnostics.rules
source: Rules: %lld
zh_hans: 规则：%lld

# diagnostics.rules_snapshot
source: Rules Data: %@
zh_hans: 规则数据：%@

# diagnostics.run_cache_flush
source: Flush FakeIP
zh_hans: 刷新 FakeIP

# diagnostics.run_configuration_reload
source: Reload Configuration
zh_hans: 重新加载配置

# diagnostics.run_core_restart
source: Restart
zh_hans: 重启

# diagnostics.run_core_upgrade
source: Upgrade
zh_hans: 升级

# diagnostics.run_dns_flush
source: Flush DNS
zh_hans: 刷新 DNS

# diagnostics.run_geo_update
source: Update GeoData
zh_hans: 更新 GeoData

# diagnostics.run_memory_check
source: Check Memory
zh_hans: 检查内存

# diagnostics.runtime_operations
source: Runtime Operations
zh_hans: 运行时操作

# diagnostics.runtime_operations_count
source: %lld actions
zh_hans: %lld 项操作

# diagnostics.runtime_operations_detail
source: Memory, DNS/FakeIP cache, and core lifecycle actions are shown only when the selected real controller reports a supported remote API path.
zh_hans: 仅当当前真实控制器报告受支持的远程 API 路径时，才显示内存、DNS/FakeIP 缓存和核心生命周期操作。

# diagnostics.secrets
source: Secrets: not included
zh_hans: 密钥：不包含

# diagnostics.section_capability_operations
source: Available Operations
zh_hans: 可用操作

# diagnostics.section_check_results
source: Check results:
zh_hans: 检查结果：

# diagnostics.section_command_count
source: Command counts
zh_hans: 命令数量

# diagnostics.section_controller_adapter
source: Controller Adapter
zh_hans: 控制器适配器

# diagnostics.section_controller_health
source: Controller Health
zh_hans: 控制器健康

# diagnostics.section_core_compatibility
source: Core Compatibility
zh_hans: 核心兼容性

# diagnostics.section_data_visibility
source: Data Visibility
zh_hans: 数据可见性

# diagnostics.section_endpoint_results
source: Endpoint Test Results:
zh_hans: 端点测试结果：

# diagnostics.section_endpoint_summary
source: Endpoint Summary
zh_hans: 端点摘要

# diagnostics.section_observability
source: Monitoring Status
zh_hans: 监控状态

# diagnostics.section_report
source: Diagnostics Report:
zh_hans: 诊断报告：

# diagnostics.section_smoke_checks
source: Real Controller Smoke Checks
zh_hans: 真实控制器冒烟检查

# diagnostics.section_snapshot_stats
source: Data counts
zh_hans: 数据数量

# diagnostics.section_surge_snapshot
source: Surge Data
zh_hans: Surge 数据

# diagnostics.section_trial_readiness
source: Next checks
zh_hans: 下一步检查

# diagnostics.section_unified_controller
source: Unified Controller
zh_hans: 统一控制器

# diagnostics.smoke_checks
source: Real Controller Smoke Checks: %@
zh_hans: 真实控制器冒烟检查：%@

# diagnostics.surge_snapshot
source: Surge Data: %@
zh_hans: Surge 数据：%@

# diagnostics.title
source: Mica Diagnostics
zh_hans: Mica 诊断

# diagnostics.trial_session
source: Check session: %@
zh_hans: 检查会话：%@

# diagnostics.ui_full_data
source: Full UI data
zh_hans: 界面全量数据

# diagnostics.unified_controller
source: Unified Controller: %@
zh_hans: 统一控制器：%@

# diagnostics.version
source: Version: %@
zh_hans: 版本：%@

# editor.acc_controller_family
source: Controller family
zh_hans: 控制器族

# editor.acc_handshake_panel
source: Controller handshake and diagnosis panel
zh_hans: 控制器握手和诊断区域

# editor.acc_host
source: Controller host field
zh_hans: 控制器主机输入框

# editor.acc_name
source: Controller display name field
zh_hans: 控制器显示名称输入框

# editor.acc_onboarding_summary
source: Controller onboarding summary
zh_hans: 控制器接入摘要

# editor.acc_port
source: Controller port field
zh_hans: 控制器端口输入框

# editor.acc_scheme
source: Controller scheme picker
zh_hans: 控制器协议选择器

# editor.acc_secret
source: Controller secret field
zh_hans: 控制器密钥输入框

# editor.acc_surge_platform
source: Surge platform
zh_hans: Surge 平台

# editor.acc_tls
source: TLS validation policy picker
zh_hans: TLS 验证策略选择器

# editor.adapter
source: Adapter
zh_hans: 适配器

# editor.add_router
source: Add Controller
zh_hans: 添加控制器

# editor.cancel
source: Cancel
zh_hans: 取消

# editor.connection_diagnosis
source: Connection Diagnosis
zh_hans: 连接诊断

# editor.controller_family
source: Controller family
zh_hans: 控制器族

# editor.controller_family_footer
source: Choose the API family Mica should use. Auto Detect probes safely without starting local cores.
zh_hans: 选择 Mica 应使用的 API 类型。自动检测只做安全探测，不启动本地核心。

# editor.controller_family_section
source: Controller type
zh_hans: 控制器类型

# editor.controller_preview
source: Controller Preview
zh_hans: 控制器预览

# editor.controller_secret
source: Controller Secret
zh_hans: 控制器密钥

# editor.controller_type
source: Controller Type
zh_hans: 控制器类型

# editor.default_controller_name
source: My Controller
zh_hans: 我的控制器

# editor.device_link
source: Device Link
zh_hans: 设备连接

# editor.edit_router
source: Edit Controller
zh_hans: 编辑控制器

# editor.header_hint
source: Use the controller host, external-controller port, and matching controller secret.
zh_hans: 使用控制器主机、external-controller 端口和匹配的控制器密钥。

# editor.help_controller_family
source: Select mihomo-compatible, Nikki, OpenClash, Surge, or automatic detection.
zh_hans: 选择 mihomo 兼容、Nikki、OpenClash、Surge，或使用自动检测。

# editor.help_handshake_panel
source: Shows the connection checklist and the latest Test Connection diagnosis.
zh_hans: 显示连接检查清单和最近一次连接测试诊断。

# editor.help_host
source: Enter the host or address where the controller HTTP API is enabled. Credentials stay local; copied reports exclude credentials and raw response bodies.
zh_hans: 输入已启用控制器 HTTP API 的主机或地址。凭据保留在本机；复制报告排除凭据和原始响应正文。

# editor.help_name
source: A local display name for this controller profile.
zh_hans: 这个控制器配置的本地显示名称。

# editor.help_port
source: Enter the external-controller or Surge HTTP API port.
zh_hans: 输入 external-controller 或 Surge HTTP API 端口。

# editor.help_save
source: Save this controller profile and keep the secret on this Mac when provided.
zh_hans: 保存此控制器配置；如提供密钥，将保存在本机。

# editor.help_scheme
source: Choose HTTP or HTTPS for the controller API.
zh_hans: 选择控制器 API 使用 HTTP 或 HTTPS。

# editor.help_secret
source: Stored locally on this Mac when saved; never shown in diagnostics.
zh_hans: 保存后存储在本机；不会显示在诊断中。

# editor.help_surge_platform
source: Describe where the user-enabled Surge HTTP API is reachable from.
zh_hans: 说明用户启用的 Surge HTTP API 可以从哪里访问。

# editor.help_test
source: Run a read-only controller reachability and JSON diagnosis.
zh_hans: 运行只读控制器连通性和 JSON 诊断。

# editor.help_tls
source: Use system trust by default. Allow self-signed only for a controller you control.
zh_hans: 默认使用系统信任。仅对你控制的控制器允许自签名。

# editor.host
source: Host
zh_hans: 主机

# editor.host_configured
source: host configured
zh_hans: 主机已配置

# editor.host_empty
source: host empty
zh_hans: 主机为空

# editor.host_prompt
source: 192.168.1.1 or openwrt.lan
zh_hans: 192.168.1.1 或 openwrt.lan

# editor.hs_json
source: Controller JSON
zh_hans: 控制器 JSON

# editor.hs_secret
source: Secret
zh_hans: 密钥

# editor.hs_version
source: Version
zh_hans: 版本

# editor.keychain_notice
source: A controller secret is saved locally. Leave the field empty to keep it.
zh_hans: 控制器密钥已保存在本地。留空以保留现有密钥。

# editor.loaded_by_version
source: Loaded by /version
zh_hans: 由 /version 加载

# editor.name
source: Name
zh_hans: 名称

# editor.onboarding_message
source: Connect to an already-running controller API, test the base endpoints, then load live controller data. Mica does not start or install any core.
zh_hans: 连接到已经运行的控制器 API，先测试基础端点，再加载真实控制器数据。Mica 不启动也不安装任何核心。

# editor.onboarding_title
source: Controller Onboarding
zh_hans: 控制器接入

# editor.outbound
source: Outbound
zh_hans: 出站

# editor.platform
source: Platform
zh_hans: 平台

# editor.port
source: Port
zh_hans: 端口

# editor.replace_secret
source: Replace existing secret
zh_hans: 替换现有密钥

# editor.report_ready %@
source: Controller ready: %@.
zh_hans: 控制器就绪：%@。

# editor.report_surge_profile_ready
source: Surge HTTP API profile is ready to test.
zh_hans: Surge HTTP API 配置已可测试。

# editor.report_surge_ready
source: Surge HTTP API ready.
zh_hans: Surge HTTP API 就绪。

# editor.run_test
source: Run Test
zh_hans: 运行测试

# editor.run_test_surge_snapshot
source: Run Test to load /v1 events, outbound, policy groups, requests, rules, and traffic.
zh_hans: 运行测试，加载 /v1 events、出站模式、策略组、请求、规则和流量。

# editor.save
source: Save
zh_hans: 保存

# editor.scheme
source: Scheme
zh_hans: 协议

# editor.secret_configured
source: Configured
zh_hans: 已配置

# editor.secret_empty
source: Empty
zh_hans: 为空

# editor.security_gate
source: Security Gate
zh_hans: 安全网关

# editor.snapshot
source: Data
zh_hans: 数据

# editor.summary_controller
source: Controller
zh_hans: 控制器

# editor.summary_secret
source: Secret
zh_hans: 密钥

# editor.summary_target
source: Target
zh_hans: 目标

# editor.surge_adapter
source: Surge HTTP API adapter
zh_hans: Surge HTTP API 适配器

# editor.surge_platform
source: Surge platform
zh_hans: Surge 平台

# editor.surge_snapshot_value %lld %lld %lld
source: %lld groups, %lld requests, %lld rules
zh_hans: %lld 个策略组，%lld 个请求，%lld 条规则

# editor.target_not_configured
source: Not configured
zh_hans: 尚未配置

# editor.target_summary %@ %@ %@
source: %@ controller endpoint · Port %@ · %@
zh_hans: %@ 控制器端点 · 端口 %@ · %@

# editor.test
source: Test
zh_hans: 测试

# editor.testing
source: Testing
zh_hans: 测试中

# editor.testing_reachability
source: Testing controller reachability...
zh_hans: 正在测试控制器可达性...

# editor.tls_self_signed
source: Allow Self-Signed Controller
zh_hans: 允许自签名控制器

# editor.tls_self_signed_short
source: Self-signed allowed
zh_hans: 允许自签

# editor.tls_system_short
source: System trust
zh_hans: 系统信任

# editor.tls_system_trust
source: System Trust
zh_hans: 系统信任

# editor.unavailable
source: Unavailable
zh_hans: 不可用

# editor.valid_controller_json
source: Valid external-controller response
zh_hans: 有效的 external-controller 响应

# editor.validated_by_test
source: Validated by Test
zh_hans: 由测试验证

# editor.validation_host_path
source: Host should not include a path.
zh_hans: 主机不应包含路径。

# editor.validation_host_required
source: Host is required.
zh_hans: 需要填写主机。

# editor.validation_host_scheme
source: Host should be an IP address or hostname. Choose HTTP or HTTPS separately.
zh_hans: 主机应为 IP 地址或主机名。HTTP/HTTPS 请单独选择。

# editor.validation_host_spaces
source: Host should not contain spaces.
zh_hans: 主机不应包含空格。

# editor.validation_name_required
source: Controller name is required.
zh_hans: 需要填写控制器名称。

# editor.validation_port_range
source: Port must be between 1 and 65535.
zh_hans: 端口必须在 1 到 65535 之间。

# endpoint.acc_health %@ %@ %@
source: %@ endpoint, API path %@, status: %@
zh_hans: %@ 端点，API 路径 %@，状态：%@

# endpoint.active_count %lld
source: %lld active
zh_hans: %lld 个活动

# endpoint.checking
source: Checking
zh_hans: 检查中

# endpoint.display_configs
source: Controller Config
zh_hans: 控制器配置

# endpoint.display_connections
source: Active Connections
zh_hans: 活动连接

# endpoint.display_providers
source: Proxy Sources
zh_hans: 代理来源

# endpoint.display_proxies
source: Policy Groups
zh_hans: 策略组

# endpoint.display_rules
source: Rule Set
zh_hans: 规则集

# endpoint.display_version
source: Controller Version
zh_hans: 控制器版本

# endpoint.failed
source: Failed
zh_hans: 失败

# endpoint.groups_count %lld
source: %lld groups
zh_hans: %lld 个组

# endpoint.idle
source: Idle
zh_hans: 空闲

# endpoint.not_checked
source: Not checked
zh_hans: 未检查

# endpoint.ok
source: OK
zh_hans: 正常

# endpoint.policies_count %lld
source: %lld policies
zh_hans: %lld 个策略

# endpoint.probe_pending
source: Probe pending
zh_hans: 探测待完成

# endpoint.providers_count %lld
source: %lld sources
zh_hans: %lld 个来源

# endpoint.ready
source: Ready
zh_hans: 就绪

# endpoint.rules_count %lld
source: %lld rules
zh_hans: %lld 条规则

# evidence.active_controller
source: Active Controller
zh_hans: 当前控制器

# evidence.app_version
source: App / Version
zh_hans: 应用 / 版本

# evidence.boundary_active_controller
source: Controller name and endpoint stay visible; copied reports exclude credentials and raw response bodies.
zh_hans: 控制器名称和端点保持可见；复制报告排除凭据和原始响应正文。

# evidence.boundary_app_version
source: App version and build context stay visible; copied reports exclude signing secrets.
zh_hans: 应用版本和构建上下文保持可见；复制报告排除签名密钥。

# evidence.boundary_capability_aggregate
source: Capability counts stay visible; copied reports exclude raw response bodies.
zh_hans: 能力数量保持可见；复制报告排除原始响应正文。

# evidence.boundary_capability_operations
source: Controller type, operation counts, and operation labels stay visible; copied reports exclude credentials and raw response or stream bodies.
zh_hans: 控制器类型、操作数量和操作标签保持可见；复制报告排除凭据以及原始响应或流正文。

# evidence.boundary_command_count
source: Command counts stay visible; copied reports exclude credentials and raw response bodies.
zh_hans: 命令数量保持可见；复制报告排除凭据和原始响应正文。

# evidence.boundary_connection_state
source: Local connection state stays visible; copied reports exclude raw controller error bodies.
zh_hans: 本地连接状态保持可见；复制报告排除原始控制器错误正文。

# evidence.boundary_controller_adapter
source: Controller family, adapter source, and capability counts stay visible; copied reports exclude credentials and raw response or stream bodies.
zh_hans: 控制器族、适配器来源和能力数量保持可见；复制报告排除凭据以及原始响应或流正文。

# evidence.boundary_controller_health
source: Endpoint targets and failure categories stay visible; copied reports exclude raw response bodies.
zh_hans: 端点目标和失败分类保持可见；复制报告排除原始响应正文。

# evidence.boundary_core_compatibility
source: Compatibility labels and endpoint targets stay visible; copied reports exclude raw version bodies.
zh_hans: 兼容性标签和端点目标保持可见；复制报告排除原始版本正文。

# evidence.boundary_data_visibility
source: Active UI shows controller-reported rows in full; copied reports exclude credentials, authorization headers, subscription URLs, raw response bodies, and raw stream bodies.
zh_hans: 活跃界面完整显示控制器报告的行数据；复制报告排除凭据、授权头、订阅 URL、原始响应正文和原始流正文。

# evidence.boundary_endpoint_summary
source: Endpoint status labels and API paths stay visible; copied reports exclude raw endpoint payloads.
zh_hans: 端点状态标签和 API 路径保持可见；复制报告排除原始端点载荷。

# evidence.boundary_observability
source: Loaded controller data and stream readiness stay visible; copied reports exclude credentials and raw response or stream bodies.
zh_hans: 已加载的控制器数据和流就绪状态保持可见；复制报告排除凭据以及原始响应或流正文。

# evidence.boundary_privacy_marker
source: Active UI shows controller data in full; copied reports exclude credentials, authorization headers, subscription URLs, and raw response or stream bodies.
zh_hans: 活跃界面完整显示控制器数据；复制报告排除凭据、授权头、订阅 URL，以及原始响应或流正文。

# evidence.boundary_smoke_checks
source: Live connection readiness and controller identifiers stay visible; copied reports exclude credentials and raw response bodies.
zh_hans: 真实连接就绪状态和控制器标识保持可见；复制报告排除凭据和原始响应正文。

# evidence.boundary_snapshot_stats
source: Data counts stay visible, and workspaces show controller-reported rows; copied reports exclude credentials and raw response bodies.
zh_hans: 数据数量保持可见，工作区显示控制器报告的行数据；复制报告排除凭据和原始响应正文。
